#include <stdio.h>

int main() {
    int score_int = 90.5;
    printf("กรณีที่ 1 (int): score = %d\n", score_int); //ใช้ int (จำนวนเต็ม) เพื่อเก็บค่า 90.5 ซึ่งเป็นเลขทศนิยม โปรแกรมจะ ตัดส่วนทศนิยมทิ้งทำให้ค่าที่เก็บได้คือ 90

    float score_float = 90.5f;
    printf("กรณีที่ 2 (float): score = %.1f\n", score_float); //ใช้ float (เลขทศนิยม) สามารถเก็บและแสดงค่า 90.5 ได้อย่างถูกต้อง

    return 0;
}
//สรุป บางทีเราอาจจะต้องการค่าเลขอย่างละเอียดเราก้ต้องใช้ float หรือค่าที่ไม่ละเอียดมากก็ใช้ int เพราะงั้นเลือกให้ถูกเนื้องาน
